



-- "경기도 성남시분당구 판교동" -> "경기도 성남시 분당구 판교동"
update "실거래_상업업무용_분당구"
set    "시군구명" = replace("시군구명", '성남시분당구', '성남시 분당구')
;

update "실거래_단독다가구_분당구"
set    "시군구명" = replace("시군구명", '성남시분당구', '성남시 분당구')
;

update "실거래_공장창고_분당구"
set    "시군구명" = replace("시군구명", '성남시분당구', '성남시 분당구')
;

update "실거래_토지_분당구"
set    "시군구명" = replace("시군구명", '성남시분당구', '성남시 분당구')
;

commit;


----------------------------------------------------------------------------------------------------------------------------------------------------------------
-- [건축물대장]
-- 오래된 건물이라 건축물대장 최초 작성(1992년 전후) 당시 대지면적, 건폐율, 용적률 등이 전산에 입력되지 않아 기본값 0으로 남아 있는 경우가 있습니다.
-- 집합건물(아파트, 오피스텔, 상가 등)처럼 대지를 구분해 쓰지 않고 ‘대지권 비율’로만 나누는 경우, 개별 호·점포의 건축물대장 표제부에는 대지면적을 0으로 두고 등기부나 토지대장에서 대지권을 확인하게 하는 사례가 많습니다.
----------------------------------------------------------------------------------------------------------------------------------------------------------------
select * from "건축물대장" where "대지_면적" = 0;



----------------------------------------------------------------------------------------------------------------------------------------------------------------
-- [실거래_단독다가구_분당구]
--  . 거래구분 = '1' 인 매매건만 분석 대상 (전세,월세 제외)
----------------------------------------------------------------------------------------------------------------------------------------------------------------

-- 1,291건
select * from "실거래_단독다가구_분당구" where "거래구분" = '1';

-- 건축물대장 매핑함수
CREATE OR REPLACE FUNCTION get_bldg_type1 (in_sigungu TEXT, in_bunji TEXT, in_doro TEXT, in_ground_area numeric, in_total_area numeric)
RETURNS TABLE ("건축물대장_PK" text, "건물_도로명_주소" text, "건물_대지_주소" text, "건물_주용도" text, "건물_기타용도" text, "건물_대지면적" numeric, "건물_연면적" numeric, "도로매핑" numeric, "용도매핑" numeric, "면적매핑" numeric) AS $$
DECLARE
	-- 로직에 필요한 변수 선언
    rec RECORD;
BEGIN
	FOR rec IN SELECT * FROM "건축물대장" WHERE "시군구명" = in_sigungu AND "번지" = in_bunji
	LOOP
		---------------------------------------------
		-- 1. 번지 매핑
		---------------------------------------------
		"건축물대장_PK" := rec."관리_건축물대장_PK";
		"건물_도로명_주소" := rec."도로명_대지_위치";
		"건물_대지_주소" := rec."대지_위치";
		"건물_주용도" := rec."주_용도_코드_명";
		"건물_기타용도" := rec."기타_용도";
		"건물_대지면적" := rec."대지_면적";
		"건물_연면적" := rec."연면적";
		---------------------------------------------
		-- 2. 도로 매핑
		---------------------------------------------
		IF rec."도로명_대지_위치" LIKE CONCAT('%', in_doro, '%') THEN
			"도로매핑" := 1;
		ELSE
			"도로매핑" := 0;
		END IF;
		---------------------------------------------
		-- 3. 용도 매핑
		---------------------------------------------
		IF "건물_주용도" = '단독주택' THEN
			"용도매핑" = 1;
		ELSE
			"용도매핑" = 0;
		END IF;
		---------------------------------------------
		-- 4. 면적 매핑
		---------------------------------------------
		if in_ground_area = rec."대지_면적" and in_total_area = rec."연면적" then
			"면적매핑" = 1;
		elsif trunc(in_ground_area) = trunc(rec."대지_면적") and trunc(in_total_area) = trunc(rec."연면적") then
			"면적매핑" = 0.5;
		elsif round(in_ground_area) = round(rec."대지_면적") and round(in_total_area) = round(rec."연면적") then
			"면적매핑" = 0.3;
		else
			"면적매핑" = 0;
		END IF;
		-- pipe
		RETURN NEXT;
	END LOOP;
	RETURN;
END;
$$ LANGUAGE plpgsql;

-- 매핑 쿼리 
SELECT "주택유형", ROUND(AVG("번지매핑건수"),1) as "번지매핑", ROUND(AVG("도로매핑건수"),1) as "도로매핑", ROUND(AVG("용도매핑건수"),1) as "용도매핑", ROUND(AVG("면적매핑건수"),1) as "면적매핑" FROM (     
select "계약년월", "번호", "주택유형", "시군구명", "번지", "도로명", "대지면적", "연면적", "거래금액", "건축물대장_PK", "건물_도로명_주소", "건물_대지_주소", "건물_주용도", "건물_기타용도", "건물_대지면적", "건물_연면적", "번지매핑건수", "도로매핑건수", "용도매핑건수",
       COUNT("건축물대장_PK") over (partition by "계약년월", "번호") as "면적매핑건수",
       ROW_NUMBER() OVER (PARTITION BY "계약년월", "번호") AS "매매별일련번호"      
from  (
		select *, COUNT("건축물대장_PK") over (partition by "계약년월", "번호") as "용도매핑건수",
			   MAX("면적매핑") over (partition by "계약년월", "번호") as "면적매핑점수"
		from   (
				select  *, COUNT("건축물대장_PK") over (partition by "계약년월", "번호") as "도로매핑건수",
				        MAX("용도매핑") over (partition by "계약년월", "번호") as "용도매핑점수"
				from   (
						SELECT  t.*, b.*, 
								COUNT("건축물대장_PK") over (partition by "계약년월", "번호") as "번지매핑건수",
								MAX("도로매핑") over (partition by "계약년월", "번호") as "도로매핑점수"
						FROM    "실거래_단독다가구_분당구" t
						        LEFT JOIN LATERAL get_bldg_type1(t."시군구명", t."번지", t."도로명", t."대지면적", t."연면적") b ON TRUE 
						WHERE   t."거래구분" = '1'
						--AND     t."계약년월" LIKE '201805' and t."번호" = 6603 
						ORDER BY t."계약년월", t."번호"
					   )
				where   "도로매핑점수" IS NULL OR "도로매핑점수" = "도로매핑"
			   )
		WHERE   "용도매핑점수" IS NULL OR "용도매핑점수" = "용도매핑"
		)
where   "면적매핑점수" IS NULL OR "면적매핑점수" = "면적매핑"
) WHERE "매매별일련번호" = 1 GROUP BY "주택유형" 
;





----------------------------------------------------------------------------------------------------------------------------------------------------------------
-- [실거래_상업업무용_분당구]
-- 1) 용도 매핑 
--   . 국토부 실거래 공개에서 상업·업무용은 “주택·토지·오피스텔·산업용 및 기타(가설건축물 등)를 제외한 건축물”로, 건축물 주용도는 “근린생활시설(1·2종), 판매시설, 교육연구시설, 숙박시설, 업무시설, 기타(운동·종교·노유자 등)” 7종류로 재분류해서 사용합니다.
--   . 즉 상업·업무용 실거래에 해당하는 건축물대장은 근린생활시설뿐 아니라 판매시설, 업무시설, 숙박시설, 교육연구시설, 노유자시설 등 여러 용도가 포함됩니다.
--   * 매매 상의 건축물주용도를 건축물대상 상의 주용도와 동일 비교 (시설 문자열 붙여서)
--   * 건축물주용도가 제1종근린생활과 제2종근린생활의 차이로 매핑이 안되는 경우가 있어서, 단독주택, 공동주택은 -1로 매핑점수 할당 (이건 확실히 아니므로)
-- 2) 면적 매핑 
--   . 매매의 대지면적과 대장의 대지_면적을 비교 (대지면적이 0인 경우 포함)
--   . 매매의 전용면적과 대장의 연면적을 비교
--   . 공동주택·집합건물처럼 대지권 지분으로만 토지를 나누는 유형은 개별 호별 “대지면적”을 비워두거나 0으로 처리하는 사례가 있습니다.
--   . 행정기관·시스템 간 연계가 불완전하거나 토지대장·건축물대장상의 대지면적이 자동 매핑되지 않은 경우에도 기본값 0으로 남을 수 있습니다.
----------------------------------------------------------------------------------------------------------------------------------------------------------------

-- 14,072건
select * from "실거래_상업업무용_분당구";

select * from "실거래_상업업무용_분당구" where "번호" = 1076;


-- 건축물대장 매핑함수
CREATE OR REPLACE FUNCTION get_bldg_type2 (in_sigungu TEXT, in_bunji TEXT, in_doro TEXT, in_floor TEXT, in_bldg_main TEXT, in_ground_area numeric, in_total_area numeric)
RETURNS TABLE ("건축물대장_PK" text, "건물_도로명_주소" text, "건물_대지_주소" text, "건물_주용도" text, "건물_기타용도" text, "건물_대지면적" numeric, "건물_연면적" numeric, "도로매핑" numeric, "용도매핑" numeric, "면적매핑" numeric) AS $$
DECLARE
	-- 로직에 필요한 변수 선언
    rec RECORD;	
	query_str TEXT;
BEGIN
	-- 1. 조건에 따라 SQL 문장 구성
    IF in_bunji LIKE '%*%' THEN
        query_str := 'SELECT * FROM "건축물대장" WHERE "시군구명" = $1 AND "번지" = $2';
    ELSE
        -- input_1에 '%'를 붙여 LIKE 검색용 파라미터 생성
        query_str := 'SELECT * FROM "건축물대장" WHERE "대지_위치" LIKE CONCAT($1, '' '', $2, ''%'')';
    END IF;

	FOR rec IN EXECUTE query_str USING in_sigungu, in_bunji
	LOOP
		---------------------------------------------
		-- 1. 번지 매핑
		---------------------------------------------
		"건축물대장_PK" := rec."관리_건축물대장_PK";
		"건물_도로명_주소" := rec."도로명_대지_위치";
		"건물_대지_주소" := rec."대지_위치";
		"건물_주용도" := rec."주_용도_코드_명";
		"건물_기타용도" := rec."기타_용도";
		"건물_대지면적" := rec."대지_면적";
		"건물_연면적" := rec."연면적";
		---------------------------------------------
		-- 2. 도로 매핑
		---------------------------------------------
		IF rec."도로명_대지_위치" LIKE CONCAT('%', in_doro, '%') THEN
			"도로매핑" := 1;
		ELSE
			"도로매핑" := 0;
		END IF;
		---------------------------------------------
		-- 3. 용도 매핑
		---------------------------------------------
		--IF "건물_주용도" in ('단독주택', '교육연구시설') then
		--	"용도매핑" := 0;
		--elsif "건물_주용도" = '공동주택' and "건물_기타용도" in ('아파트', '지하주차장') then
		--	"용도매핑" := 0;
		--elsif "건물_주용도" = '공장' then
		--	"용도매핑" := 0;
		--else
		--	"용도매핑" := 1;
		--end if;
		if CONCAT(in_bldg_main, '시설') = rec."주_용도_코드_명" then
			if rec."기타_용도" in ('지하주차장', '지하변전실', '경비초소', '관리사무소.노인정') then
				"용도매핑" := 0;
			else
				"용도매핑" := 1;
			end if;
		elsif rec."주_용도_코드_명" in ('단독주택','공동주택','공장','토지') then
			"용도매핑" := -1;
		else
			"용도매핑" := 0;
		end if;
		---------------------------------------------
		-- 4. 면적 매핑
		---------------------------------------------
		if in_ground_area = rec."대지_면적" then
			"면적매핑" := 1;
		elsif trunc(in_ground_area) = trunc(rec."대지_면적") then
			"면적매핑" := 0.5;
		elsif round(in_ground_area) = round(rec."대지_면적") then
			"면적매핑" := 0.3;
		else
			"면적매핑" := 0;
		END IF;
		-- pipe
		RETURN NEXT;
	END LOOP;
	RETURN;
END;
$$ LANGUAGE plpgsql;



-- 매핑 쿼리 
SELECT "유형", ROUND(AVG("번지매핑건수"),1) as "번지매핑", ROUND(AVG("도로매핑건수"),1) as "도로매핑", ROUND(AVG("용도매핑건수"),1) as "용도매핑", ROUND(AVG("면적매핑건수"),1) as "면적매핑" FROM (     
select "계약년월", "번호", "유형", "시군구명", "지번", "도로명", "층", "용도지역", "건축물주용도", "대지면적", "전용면적", "거래금액", "건축물대장_PK", "건물_도로명_주소", "건물_대지_주소", "건물_주용도", "건물_기타용도", "건물_대지면적", "건물_연면적", "번지매핑건수", "도로매핑건수", "용도매핑건수", "도로매핑", "용도매핑", "면적매핑",
       COUNT("건축물대장_PK") over (partition by "계약년월", "번호") as "면적매핑건수",
       ROW_NUMBER() OVER (PARTITION BY "계약년월", "번호") AS "매매별일련번호"      
from  (
		select *, COUNT("건축물대장_PK") over (partition by "계약년월", "번호") as "용도매핑건수",
			   MAX("면적매핑") over (partition by "계약년월", "번호") as "면적매핑점수"
		from   (
				select  *, COUNT("건축물대장_PK") over (partition by "계약년월", "번호") as "도로매핑건수",
				        MAX("용도매핑") over (partition by "계약년월", "번호") as "용도매핑점수"
				from   (
						SELECT  t.*, b.*, 
								COUNT("건축물대장_PK") over (partition by "계약년월", "번호") as "번지매핑건수",
								MAX("도로매핑") over (partition by "계약년월", "번호") as "도로매핑점수"
						FROM    "실거래_상업업무용_분당구" t
						        LEFT JOIN LATERAL get_bldg_type2(t."시군구명", t."지번", t."도로명", t."층", t."건축물주용도", t."대지면적", t."전용면적") b ON TRUE 
						WHERE   1=1
						--AND     t."계약년월" LIKE '2025%' --and t."번호" = 5866
						ORDER BY t."계약년월", t."번호"
					   )
				where   "도로매핑점수" IS NULL OR "도로매핑점수" = "도로매핑"
			   )
		WHERE   "용도매핑점수" IS NULL OR "용도매핑점수" = "용도매핑"
		)
where   "면적매핑점수" IS NULL OR "면적매핑점수" = "면적매핑"
) WHERE "매매별일련번호" = 1 GROUP BY "유형" 
;


----------------------------------------------------------------------------------------------------------------------------------------------------------------
-- [실거래_공장창고_분당구]
-- 1) 용도매핑 
--    . 근린생활시설 또는 주택(단독,공동)은 제외
----------------------------------------------------------------------------------------------------------------------------------------------------------------

-- 365건
select * from "실거래_공장창고_분당구";


-- 건축물대장 매핑함수
CREATE OR REPLACE FUNCTION get_bldg_type3 (in_sigungu TEXT, in_bunji TEXT, in_doro TEXT, in_ground_area numeric, in_total_area numeric)
RETURNS TABLE ("건축물대장_PK" text, "건물_도로명_주소" text, "건물_대지_주소" text, "건물_주용도" text, "건물_기타용도" text, "건물_대지면적" numeric, "건물_연면적" numeric, "도로매핑" numeric, "용도매핑" numeric, "면적매핑" numeric) AS $$
DECLARE
	-- 로직에 필요한 변수 선언
    rec RECORD;
	query_str text;
BEGIN
	-- 1. 조건에 따라 SQL 문장 구성
    IF in_bunji LIKE '%*%' THEN
        query_str := 'SELECT * FROM "건축물대장" WHERE "시군구명" = $1 AND "번지" = $2';
    ELSE
        -- input_1에 '%'를 붙여 LIKE 검색용 파라미터 생성
        query_str := 'SELECT * FROM "건축물대장" WHERE "대지_위치" LIKE CONCAT($1, '' '', $2, ''%'')';
    END IF;

	FOR rec IN EXECUTE query_str USING in_sigungu, in_bunji
	LOOP
		---------------------------------------------
		-- 1. 번지 매핑
		---------------------------------------------
		"건축물대장_PK" := rec."관리_건축물대장_PK";
		"건물_도로명_주소" := rec."도로명_대지_위치";
		"건물_대지_주소" := rec."대지_위치";
		"건물_주용도" := rec."주_용도_코드_명";
		"건물_기타용도" := rec."기타_용도";
		"건물_대지면적" := rec."대지_면적";
		"건물_연면적" := rec."연면적";
		---------------------------------------------
		-- 2. 도로 매핑
		---------------------------------------------
		IF rec."도로명_대지_위치" LIKE CONCAT('%', in_doro, '%') THEN
			"도로매핑" := 1;
		ELSE
			"도로매핑" := 0;
		END IF;
		---------------------------------------------
		-- 3. 용도 매핑
		---------------------------------------------
		IF "건물_주용도" LIKE '%근린생활시설%' THEN 
			"용도매핑" := 0;
		ELSIF "건물_주용도" in ('단독주택', '공동주택') then
			"용도매핑" := 0;
		ELSE
			"용도매핑" := 1;
		END IF;
		---------------------------------------------
		-- 4. 면적 매핑
		---------------------------------------------
		if in_total_area = rec."연면적" then
			"면적매핑" := 1;
		elsif trunc(in_total_area) = trunc(rec."연면적") then
			"면적매핑" := 0.5;
		elsif round(in_total_area) = round(rec."연면적") then
			"면적매핑" := 0.3;
		else
			"면적매핑" := 0;
		END IF;
		-- pipe
		RETURN NEXT;
	END LOOP;
	RETURN;
END;
$$ LANGUAGE plpgsql;




-- 매핑 쿼리 
--SELECT "유형", ROUND(AVG("번지매핑건수"),1) as "번지매핑", ROUND(AVG("도로매핑건수"),1) as "도로매핑", ROUND(AVG("용도매핑건수"),1) as "용도매핑", ROUND(AVG("면적매핑건수"),1) as "면적매핑" FROM (     
select "계약년월", "번호", "유형", "시군구명", "지번", "도로명", "대지면적", "전용면적", "거래금액", "건축물대장_PK", "건물_도로명_주소", "건물_대지_주소", "건물_주용도", "건물_기타용도", "건물_대지면적", "건물_연면적", "번지매핑건수", "도로매핑건수", "용도매핑건수", "도로매핑", "용도매핑", "면적매핑",
       COUNT("건축물대장_PK") over (partition by "계약년월", "번호") as "면적매핑건수",
       ROW_NUMBER() OVER (PARTITION BY "계약년월", "번호") AS "매매별일련번호"      
from  (
		select *, COUNT("건축물대장_PK") over (partition by "계약년월", "번호") as "용도매핑건수",
			   MAX("면적매핑") over (partition by "계약년월", "번호") as "면적매핑점수"
		from   (
				select  *, COUNT("건축물대장_PK") over (partition by "계약년월", "번호") as "도로매핑건수",
				        MAX("용도매핑") over (partition by "계약년월", "번호") as "용도매핑점수"
				from   (
						SELECT  t.*, b.*, 
								COUNT("건축물대장_PK") over (partition by "계약년월", "번호") as "번지매핑건수",
								MAX("도로매핑") over (partition by "계약년월", "번호") as "도로매핑점수"
						FROM    "실거래_공장창고_분당구" t
						        LEFT JOIN LATERAL get_bldg_type2(t."시군구명", t."지번", t."도로명", t."대지면적", t."전용면적") b ON TRUE 
						WHERE   1=1
						--AND     t."계약년월" LIKE '201501' and t."번호" = 5866
						ORDER BY t."계약년월", t."번호"
					   )
				where   "도로매핑점수" IS NULL OR "도로매핑점수" = "도로매핑"
			   )
		WHERE   "용도매핑점수" IS NULL OR "용도매핑점수" = "용도매핑"
		)
where   "면적매핑점수" IS NULL OR "면적매핑점수" = "면적매핑"
--) WHERE "매매별일련번호" = 1 GROUP BY "유형" 
;

----------------------------------------------------------------------------------------------------------------------------------------------------------------
-- [실거래_토지_분당구]
--  토지대장이 필요 
----------------------------------------------------------------------------------------------------------------------------------------------------------------

-- 10,227건
select * from "실거래_토지_분당구";


